Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_tim_ex.h
/**
  ******************************************************************************
  * @file    py32e407_hal_tim_ex.h
  * @author  MCU Application Team
  * @brief   Header file of TIM HAL Extended module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef PY32E407_HAL_TIM_EX_H
#define PY32E407_HAL_TIM_EX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32e407_hal_def.h"

/** @addtogroup PY32E407_HAL_Driver
  * @{
  */

/** @addtogroup TIMEx
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup TIMEx_Exported_Types TIM Extended Exported Types
  * @{
  */

/**
  * @brief  TIM Hall sensor Configuration Structure definition
  */

typedef struct
{
  uint32_t IC1Polarity;         /*!< Specifies the active edge of the input signal.
                                     This parameter can be a value of @ref TIM_Input_Capture_Polarity */

  uint32_t IC1Prescaler;        /*!< Specifies the Input Capture Prescaler.
                                     This parameter can be a value of @ref TIM_Input_Capture_Prescaler */

  uint32_t IC1Filter;           /*!< Specifies the input capture filter.
                                     This parameter can be a number between Min_Data = 0x0 and Max_Data = 0xF */

  uint32_t Commutation_Delay;   /*!< Specifies the pulse value to be loaded into the Capture Compare Register.
                                     This parameter can be a number between Min_Data = 0x0000 and Max_Data = 0xFFFF */
} TIM_HallSensor_InitTypeDef;

/**
  * @brief  TIM Break/Break2 input configuration
  */
typedef struct
{
  uint32_t Source;         /*!< Specifies the source of the timer break input.
                                This parameter can be a value of @ref TIMEx_Break_Input_Source */
  uint32_t Enable;         /*!< Specifies whether or not the break input source is enabled.
                                This parameter can be a value of @ref TIMEx_Break_Input_Source_Enable */
  uint32_t Polarity;       /*!< Specifies the break input source polarity.
                                This parameter can be a value of @ref TIMEx_Break_Input_Source_Polarity */
} TIMEx_BreakInputConfigTypeDef;

/**
  * @brief  TIM Encoder index configuration
  */
typedef struct
{
  uint32_t Polarity;                  /*!< TIM Encoder index polarity.This parameter can be a value of @ref TIMEx_Encoder_Index_Polarity */

  uint32_t Prescaler;                 /*!< TIM Encoder index prescaler.This parameter can be a value of @ref TIMEx_Encoder_Index_Prescaler */

  uint32_t Filter;                    /*!< TIM Encoder index filter.This parameter can be a number between Min_Data = 0x0 and Max_Data = 0xF */

  FunctionalState  FirstIndexEnable;  /*!< Specifies whether or not the encoder first index is enabled.This parameter value can be ENABLE or DISABLE. */

  uint32_t Position;                  /*!< Specifies in which AB input configuration the index event resets the counter.This parameter can be a value of @ref TIMEx_Encoder_Index_Position */

  uint32_t Direction;                 /*!< Specifies in which counter direction the index event resets the counter.This parameter can be a value of @ref TIMEx_Encoder_Index_Direction */

} TIMEx_EncoderIndexConfigTypeDef;

/**
  * @}
  */
/* End of exported types -----------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup TIMEx_Exported_Constants TIM Extended Exported Constants
  * @{
  */

/** @defgroup TIMEx_Remap TIM Extended Remapping
  * @{
  */
#define TIM_TIM1_ETR_GPIO        0x00000000U                                                                      /*!< ETR input is connected to GPIO */
#define TIM_TIM1_ETR_COMP1       (                                                            TIM1_AF1_ETRSEL_0)  /*!< ETR input is connected to COMP1_OUT */
#define TIM_TIM1_ETR_COMP2       (                                        TIM1_AF1_ETRSEL_1                    )  /*!< ETR input is connected to COMP2_OUT */
#define TIM_TIM1_ETR_COMP3       (                                        TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0)  /*!< ETR input is connected to COMP3_OUT */
#define TIM_TIM1_ETR_COMP4       (                    TIM1_AF1_ETRSEL_2                                        )  /*!< ETR input is connected to COMP4_OUT */
#define TIM_TIM1_ETR_ADC1_AWD1   (                    TIM1_AF1_ETRSEL_2                     | TIM1_AF1_ETRSEL_0)  /*!< ADC1 analog watchdog 1 */
#define TIM_TIM1_ETR_ADC1_AWD2   (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1                    )  /*!< ADC1 analog watchdog 2 */
#define TIM_TIM1_ETR_ADC1_AWD3   (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0)  /*!< ADC1 analog watchdog 3 */

#define TIM_TIM2_ETR_GPIO         0x00000000U                                                                     /*!< ETR input is connected to GPIO */
#define TIM_TIM2_ETR_COMP1        (                                                            TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to COMP1_OUT */
#define TIM_TIM2_ETR_COMP2        (                                        TIM1_AF1_ETRSEL_1                    ) /*!< ETR input is connected to COMP2_OUT */
#define TIM_TIM2_ETR_COMP3        (                                        TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to COMP3_OUT */
#define TIM_TIM2_ETR_COMP4        (                    TIM1_AF1_ETRSEL_2                                        ) /*!< ETR input is connected to COMP4_OUT */
#define TIM_TIM2_ETR_TIM3_ETR     (                    TIM1_AF1_ETRSEL_2                     | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to TIM3 ETR */
#define TIM_TIM2_ETR_TIM4_ETR     (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1                    ) /*!< ETR input is connected to TIM4 ETR */
#define TIM_TIM2_ETR_TIM5_ETR     (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to TIM5 ETR */
#define TIM_TIM2_ETR_TIM18_ETR    (TIM1_AF1_ETRSEL_3                                                            ) /*!< ETR input is connected to TIM18_ETR */

#define TIM_TIM3_ETR_GPIO         0x00000000U                                                                     /*!< ETR input is connected to GPIO */
#define TIM_TIM3_ETR_COMP1        (                                                            TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to COMP1_OUT */
#define TIM_TIM3_ETR_COMP2        (                                        TIM1_AF1_ETRSEL_1                    ) /*!< ETR input is connected to COMP2_OUT */
#define TIM_TIM3_ETR_COMP3        (                                        TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to COMP3_OUT */
#define TIM_TIM3_ETR_COMP4        (                    TIM1_AF1_ETRSEL_2                                        ) /*!< ETR input is connected to COMP4_OUT */
#define TIM_TIM3_ETR_TIM2_ETR     (                    TIM1_AF1_ETRSEL_2                     | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to TIM2 ETR */
#define TIM_TIM3_ETR_TIM4_ETR     (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1                    ) /*!< ETR input is connected to TIM4 ETR */
#define TIM_TIM3_ETR_ADC2_AWD1    (TIM1_AF1_ETRSEL_3                                                            ) /*!< ADC2 analog watchdog 1 */
#define TIM_TIM3_ETR_ADC2_AWD2    (TIM1_AF1_ETRSEL_3                                         | TIM1_AF1_ETRSEL_0) /*!< ADC2 analog watchdog 2 */
#define TIM_TIM3_ETR_ADC2_AWD3    (TIM1_AF1_ETRSEL_3                     | TIM1_AF1_ETRSEL_1                    ) /*!< ADC2 analog watchdog 3 */

#define TIM_TIM4_ETR_GPIO         0x00000000U                                                                     /*!< ETR input is connected to GPIO */
#define TIM_TIM4_ETR_COMP1        (                                                            TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to COMP1_OUT */
#define TIM_TIM4_ETR_COMP2        (                                        TIM1_AF1_ETRSEL_1                    ) /*!< ETR input is connected to COMP2_OUT */
#define TIM_TIM4_ETR_COMP3        (                                        TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to COMP3_OUT */
#define TIM_TIM4_ETR_COMP4        (                    TIM1_AF1_ETRSEL_2                                        ) /*!< ETR input is connected to COMP4_OUT */
#define TIM_TIM4_ETR_TIM3_ETR     (                    TIM1_AF1_ETRSEL_2                     | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to TIM3 ETR */
#define TIM_TIM4_ETR_TIM5_ETR     (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1                    ) /*!< ETR input is connected to TIM5 ETR */
#define TIM_TIM4_ETR_TIM18_ETR    (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to TIM18 ETR */

#define TIM_TIM5_ETR_GPIO         0x00000000U                                                                     /*!< ETR input is connected to GPIO */
#define TIM_TIM5_ETR_COMP1        (                                                            TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to COMP1_OUT */
#define TIM_TIM5_ETR_COMP2        (                                        TIM1_AF1_ETRSEL_1                    ) /*!< ETR input is connected to COMP2_OUT */
#define TIM_TIM5_ETR_COMP3        (                                        TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to COMP3_OUT */
#define TIM_TIM5_ETR_COMP4        (                    TIM1_AF1_ETRSEL_2                                        ) /*!< ETR input is connected to COMP4_OUT */
#define TIM_TIM5_ETR_TIM2_ETR     (                    TIM1_AF1_ETRSEL_2                     | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to TIM2 ETR */
#define TIM_TIM5_ETR_TIM3_ETR     (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1                    ) /*!< ETR input is connected to TIM3 ETR */
#define TIM_TIM5_ETR_TIM18_ETR    (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to TIM18 ETR */

#define TIM_TIM8_ETR_GPIO         0x00000000U                                                                      /*!< ETR input is connected to GPIO */
#define TIM_TIM8_ETR_COMP1        (                                                            TIM1_AF1_ETRSEL_0)  /*!< ETR input is connected to COMP1_OUT */
#define TIM_TIM8_ETR_COMP2        (                                        TIM1_AF1_ETRSEL_1                    )  /*!< ETR input is connected to COMP2_OUT */
#define TIM_TIM8_ETR_COMP3        (                                        TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0)  /*!< ETR input is connected to COMP3_OUT */
#define TIM_TIM8_ETR_COMP4        (                    TIM1_AF1_ETRSEL_2                                        )  /*!< ETR input is connected to COMP4_OUT */
#define TIM_TIM8_ETR_ADC2_AWD1    (                    TIM1_AF1_ETRSEL_2                     | TIM1_AF1_ETRSEL_0)  /*!< ADC2 analog watchdog 1 */
#define TIM_TIM8_ETR_ADC2_AWD2    (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1                    )  /*!< ADC2 analog watchdog 2 */
#define TIM_TIM8_ETR_ADC2_AWD3    (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0)  /*!< ADC2 analog watchdog 3 */
#define TIM_TIM8_ETR_ADC3_AWD1    (TIM1_AF1_ETRSEL_3                                                            )  /*!< ADC3 analog watchdog 1 */
#define TIM_TIM8_ETR_ADC3_AWD2    (TIM1_AF1_ETRSEL_3                                         | TIM1_AF1_ETRSEL_0)  /*!< ADC3 analog watchdog 2 */
#define TIM_TIM8_ETR_ADC3_AWD3    (TIM1_AF1_ETRSEL_3                     | TIM1_AF1_ETRSEL_1                    )  /*!< ADC3 analog watchdog 3 */

