Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_tim_ex.h
#define TIM_TIM18_ETR_GPIO        0x00000000U                                                                      /*!< ETR input is connected to GPIO */
#define TIM_TIM18_ETR_COMP1       (                                                            TIM1_AF1_ETRSEL_0)  /*!< ETR input is connected to COMP1_OUT */
#define TIM_TIM18_ETR_COMP2       (                                        TIM1_AF1_ETRSEL_1                    )  /*!< ETR input is connected to COMP2_OUT */
#define TIM_TIM18_ETR_COMP3       (                                        TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0)  /*!< ETR input is connected to COMP3_OUT */
#define TIM_TIM18_ETR_COMP4       (                    TIM1_AF1_ETRSEL_2                                        )  /*!< ETR input is connected to COMP4_OUT */
#define TIM_TIM18_ETR_TIM3_ETR    (                    TIM1_AF1_ETRSEL_2                     | TIM1_AF1_ETRSEL_0)  /*!< ETR input is connected to TIM3 ETR*/
#define TIM_TIM18_ETR_TIM4_ETR    (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1                    )  /*!< ETR input is connected to TIM4 ETR*/
#define TIM_TIM18_ETR_TIM5_ETR    (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0)  /*!< ETR input is connected to TIM5 ETR */


/**
  * @}
  */

/** @defgroup TIMEx_Break_Input TIM Extended Break input
  * @{
  */
#define TIM_BREAKINPUT_BRK     0x00000001U                                      /*!< Timer break input  */
#define TIM_BREAKINPUT_BRK2    0x00000002U                                      /*!< Timer break2 input */
/**
  * @}
  */

/** @defgroup TIMEx_Break_Input_Source TIM Extended Break input source
  * @{
  */
#define TIM_BREAKINPUTSOURCE_BKIN     0x00000001U                               /*!< An external source (GPIO) is connected to the BKIN pin  */
#define TIM_BREAKINPUTSOURCE_COMP1    0x00000002U                               /*!< The COMP1 output is connected to the break input */
#define TIM_BREAKINPUTSOURCE_COMP2    0x00000004U                               /*!< The COMP2 output is connected to the break input */
#define TIM_BREAKINPUTSOURCE_COMP3    0x00000008U                               /*!< The COMP3 output is connected to the break input */
#define TIM_BREAKINPUTSOURCE_COMP4    0x00000010U                               /*!< The COMP4 output is connected to the break input */

/**
  * @}
  */

/** @defgroup TIMEx_Break_Input_Source_Enable TIM Extended Break input source enabling
  * @{
  */
#define TIM_BREAKINPUTSOURCE_DISABLE     0x00000000U                            /*!< Break input source is disabled */
#define TIM_BREAKINPUTSOURCE_ENABLE      0x00000001U                            /*!< Break input source is enabled */
/**
  * @}
  */

/** @defgroup TIMEx_Break_Input_Source_Polarity TIM Extended Break input polarity
  * @{
  */
#define TIM_BREAKINPUTSOURCE_POLARITY_LOW     0x00000001U                       /*!< Break input source is active low */
#define TIM_BREAKINPUTSOURCE_POLARITY_HIGH    0x00000000U                       /*!< Break input source is active_high */
/**
  * @}
  */

/** @defgroup TIMEx_Timer_Input_Selection TIM Extended Timer input selection
  * @{
  */
#define TIM_TIM1_TI1_GPIO     0x00000000U                                                    /*!< TIM1 input 1 is connected to GPIO */
#define TIM_TIM1_TI1_COMP1    (                                          TIM_TISEL_TI1SEL_0) /*!< TIM1 input 1 is connected to COMP1_OUT */
#define TIM_TIM1_TI1_COMP2    (                     TIM_TISEL_TI1SEL_1                     ) /*!< TIM1 input 1 is connected to COMP2_OUT */
#define TIM_TIM1_TI1_COMP3    (                     TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0) /*!< TIM1 input 1 is connected to COMP3_OUT */
#define TIM_TIM1_TI1_COMP4    (TIM_TISEL_TI1SEL_2                                          ) /*!< TIM1 input 1 is connected to COMP4_OUT */

#define TIM_TIM2_TI1_GPIO     0x00000000U                                                    /*!< TIM2 input 1 is connected to GPIO */
#define TIM_TIM2_TI1_COMP1    (                                          TIM_TISEL_TI1SEL_0) /*!< TIM2 input 1 is connected to COMP1_OUT */
#define TIM_TIM2_TI1_COMP2    (                     TIM_TISEL_TI1SEL_1                     ) /*!< TIM2 input 1 is connected to COMP2_OUT */
#define TIM_TIM2_TI1_COMP3    (                     TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0) /*!< TIM2 input 1 is connected to COMP3_OUT */
#define TIM_TIM2_TI1_COMP4    (TIM_TISEL_TI1SEL_2                                          ) /*!< TIM2 input 1 is connected to COMP4_OUT */

#define TIM_TIM2_TI2_GPIO     0x00000000U                                                    /*!< TIM2 input 2 is connected to GPIO */
#define TIM_TIM2_TI2_COMP1    (                                          TIM_TISEL_TI2SEL_0) /*!< TIM2 input 2 is connected to COMP1_OUT */
#define TIM_TIM2_TI2_COMP2    (                     TIM_TISEL_TI2SEL_1                     ) /*!< TIM2 input 2 is connected to COMP2_OUT */
#define TIM_TIM2_TI2_COMP3    (                     TIM_TISEL_TI2SEL_1 | TIM_TISEL_TI2SEL_0) /*!< TIM2 input 2 is connected to COMP3_OUT */
#define TIM_TIM2_TI2_COMP4    (TIM_TISEL_TI2SEL_2                                          )  /*!< TIM2 input 2 is connected to COMP4_OUT */

#define TIM_TIM2_TI3_GPIO     0x00000000U                                                    /*!< TIM2 input 3 is connected to GPIO */
#define TIM_TIM2_TI3_COMP4    (                                          TIM_TISEL_TI3SEL_0) /*!< TIM2 input 3 is connected to COMP4_OUT */

#define TIM_TIM2_TI4_GPIO     0x00000000U                                                    /*!< TIM2 input 4 is connected to GPIO */
#define TIM_TIM2_TI4_COMP1    (                                          TIM_TISEL_TI4SEL_0) /*!< TIM2 input 4 is connected to COMP1_OUT */
#define TIM_TIM2_TI4_COMP2    (                     TIM_TISEL_TI4SEL_1                     ) /*!< TIM2 input 4 is connected to COMP2_OUT */

#define TIM_TIM3_TI1_GPIO     0x00000000U                                                    /*!< TIM3 input 1 is connected to GPIO */
#define TIM_TIM3_TI1_COMP1    (                                          TIM_TISEL_TI1SEL_0) /*!< TIM3 input 1 is connected to COMP1_OUT */
#define TIM_TIM3_TI1_COMP2    (                     TIM_TISEL_TI1SEL_1                     ) /*!< TIM3 input 1 is connected to COMP2_OUT */
#define TIM_TIM3_TI1_COMP3    (                     TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0) /*!< TIM3 input 1 is connected to COMP3_OUT */
#define TIM_TIM3_TI1_COMP4    (TIM_TISEL_TI1SEL_2                                          ) /*!< TIM3 input 1 is connected to COMP4_OUT */

