Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_tim_ex.h
#define TIM_TIM3_TI2_GPIO     0x00000000U                                                    /*!< TIM3 input 2 is connected to GPIO */
#define TIM_TIM3_TI2_COMP1    (                                          TIM_TISEL_TI2SEL_0) /*!< TIM3 input 2 is connected to COMP1_OUT */
#define TIM_TIM3_TI2_COMP2    (                     TIM_TISEL_TI2SEL_1                     ) /*!< TIM3 input 2 is connected to COMP2_OUT */
#define TIM_TIM3_TI2_COMP3    (                     TIM_TISEL_TI2SEL_1 | TIM_TISEL_TI2SEL_0) /*!< TIM3 input 2 is connected to COMP3_OUT */
#define TIM_TIM3_TI2_COMP4    (TIM_TISEL_TI2SEL_2                                          ) /*!< TIM3 input 2 is connected to COMP4_OUT */

#define TIM_TIM3_TI3_GPIO     0x00000000U                                                    /*!< TIM3 input 3 is connected to GPIO */
#define TIM_TIM3_TI3_COMP3    (                                          TIM_TISEL_TI3SEL_0) /*!< TIM3 input 3 is connected to COMP3_OUT */

#define TIM_TIM4_TI1_GPIO     0x00000000U                                                    /*!< TIM4 input 1 is connected to GPIO */
#define TIM_TIM4_TI1_COMP1    (                                          TIM_TISEL_TI1SEL_0) /*!< TIM4 input 1 is connected to COMP1_OUT */
#define TIM_TIM4_TI1_COMP2    (                     TIM_TISEL_TI1SEL_1                     ) /*!< TIM4 input 1 is connected to COMP2_OUT */
#define TIM_TIM4_TI1_COMP3    (                     TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0) /*!< TIM4 input 1 is connected to COMP3_OUT */
#define TIM_TIM4_TI1_COMP4    (TIM_TISEL_TI1SEL_2                                          ) /*!< TIM4 input 1 is connected to COMP4_OUT */

#define TIM_TIM4_TI2_GPIO     0x00000000U                                                    /*!< TIM4 input 2 is connected to GPIO */
#define TIM_TIM4_TI2_COMP1    (                                          TIM_TISEL_TI2SEL_0) /*!< TIM4 input 2 is connected to COMP1_OUT */
#define TIM_TIM4_TI2_COMP2    (                     TIM_TISEL_TI2SEL_1                     ) /*!< TIM4 input 2 is connected to COMP2_OUT */
#define TIM_TIM4_TI2_COMP3    (                     TIM_TISEL_TI2SEL_1 | TIM_TISEL_TI2SEL_0) /*!< TIM4 input 2 is connected to COMP3_OUT */
#define TIM_TIM4_TI2_COMP4    (TIM_TISEL_TI2SEL_2                                          ) /*!< TIM4 input 2 is connected to COMP4_OUT */

#define TIM_TIM4_TI3_GPIO     0x00000000U                                                    /*!< TIM4 input 3 is connected to GPIO */
#define TIM_TIM4_TI3_COMP2    (                                          TIM_TISEL_TI3SEL_0) /*!< TIM4 input 3 is connected to COMP2_OUT */

#define TIM_TIM4_TI4_GPIO     0x00000000U                                                    /*!< TIM4 input 4 is connected to GPIO */
#define TIM_TIM4_TI4_COMP3    (                                          TIM_TISEL_TI4SEL_0) /*!< TIM4 input 4 is connected to COMP3_OUT */


#define TIM_TIM5_TI1_GPIO     0x00000000U                                                    /*!< TIM5 input 1 is connected to GPIO */
#define TIM_TIM5_TI1_LSI      (                                          TIM_TISEL_TI1SEL_0) /*!< TIM5 input 1 is connected to LSI */
#define TIM_TIM5_TI1_COMP1    (TIM_TISEL_TI1SEL_2                                          ) /*!< TIM5 input 1 is connected to COMP1_OUT */
#define TIM_TIM5_TI1_COMP2    (TIM_TISEL_TI1SEL_2                      | TIM_TISEL_TI1SEL_0) /*!< TIM5 input 1 is connected to COMP2_OUT */
#define TIM_TIM5_TI1_COMP3    (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1                     ) /*!< TIM5 input 1 is connected to COMP3_OUT */
#define TIM_TIM5_TI1_COMP4    (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0) /*!< TIM5 input 1 is connected to COMP4_OUT */

#define TIM_TIM5_TI2_GPIO     0x00000000U                                                    /*!< TIM5 input 2 is connected to GPIO */
#define TIM_TIM5_TI2_COMP1    (                                          TIM_TISEL_TI2SEL_0) /*!< TIM5 input 2 is connected to COMP1_OUT */
#define TIM_TIM5_TI2_COMP2    (                     TIM_TISEL_TI2SEL_1                     ) /*!< TIM5 input 2 is connected to COMP2_OUT */
#define TIM_TIM5_TI2_COMP3    (                     TIM_TISEL_TI2SEL_1 | TIM_TISEL_TI2SEL_0) /*!< TIM5 input 2 is connected to COMP3_OUT */
#define TIM_TIM5_TI2_COMP4    (TIM_TISEL_TI2SEL_2                                          ) /*!< TIM5 input 2 is connected to COMP4_OUT */


#define TIM_TIM8_TI1_GPIO     0x00000000U                                                    /*!< TIM8 input 1 is connected to GPIO */
#define TIM_TIM8_TI1_COMP1    (                                          TIM_TISEL_TI1SEL_0) /*!< TIM8 input 1 is connected to COMP1_OUT */
#define TIM_TIM8_TI1_COMP2    (                     TIM_TISEL_TI1SEL_1                     ) /*!< TIM8 input 1 is connected to COMP2_OUT */
#define TIM_TIM8_TI1_COMP3    (                     TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0) /*!< TIM8 input 1 is connected to COMP3_OUT */
#define TIM_TIM8_TI1_COMP4    (TIM_TISEL_TI1SEL_2                                          ) /*!< TIM8 input 1 is connected to COMP4_OUT */


#define TIM_TIM15_TI1_GPIO    0x00000000U                                                    /*!< TIM15 input 1 is connected to GPIO */
#define TIM_TIM15_TI1_COMP1   (                     TIM_TISEL_TI1SEL_1                     ) /*!< TIM15 input 1 is connected to COMP1_OUT */
#define TIM_TIM15_TI1_COMP2   (                     TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0) /*!< TIM15 input 1 is connected to COMP2_OUT */


#define TIM_TIM15_TI2_GPIO    0x00000000U                                                    /*!< TIM15 input 2 is connected to GPIO */
#define TIM_TIM15_TI2_COMP2   (                                          TIM_TISEL_TI2SEL_0) /*!< TIM15 input 2 is connected to COMP2_OUT */
#define TIM_TIM15_TI2_COMP3   (                     TIM_TISEL_TI2SEL_1                     ) /*!< TIM15 input 2 is connected to COMP3_OUT */


#define TIM_TIM16_TI1_GPIO    0x00000000U                                                    /*!< TIM16 input 1 is connected to GPIO */
#define TIM_TIM16_TI1_MCO     (                     TIM_TISEL_TI1SEL_1                     ) /*!< TIM16 input 1 is connected to MCO */
#define TIM_TIM16_TI1_HSE_32  (                     TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0) /*!< TIM16 input 1 is connected to HSE/32 */
#define TIM_TIM16_TI1_LSI     (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1                     ) /*!< TIM16 input 1 is connected to LSI */


#define TIM_TIM17_TI1_GPIO    0x00000000U                                                    /*!< TIM17 input 1 is connected to GPIO */
#define TIM_TIM17_TI1_MCO     (                     TIM_TISEL_TI1SEL_1                     ) /*!< TIM17 input 1 is connected to MCO */
#define TIM_TIM17_TI1_HSE_32  (                     TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0) /*!< TIM17 input 1 is connected to HSE/32 */
#define TIM_TIM17_TI1_LSI     (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1                     ) /*!< TIM17 input 1 is connected to LSI */


#define TIM_TIM18_TI1_GPIO    0x00000000U                                                   /*!< TIM18 input 1 is connected to GPIO */
#define TIM_TIM18_TI1_COMP1   (                                          TIM_TISEL_TI1SEL_0) /*!< TIM18 input 1 is connected to COMP1_OUT */
#define TIM_TIM18_TI1_COMP2   (                     TIM_TISEL_TI1SEL_1                     ) /*!< TIM18 input 1 is connected to COMP2_OUT */
#define TIM_TIM18_TI1_COMP3   (                     TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0) /*!< TIM18 input 1 is connected to COMP3_OUT */
#define TIM_TIM18_TI1_COMP4   (TIM_TISEL_TI1SEL_2                                          ) /*!< TIM18 input 1 is connected to COMP4_OUT */

#define TIM_TIM18_TI2_GPIO    0x00000000U                                                   /*!< TIM18 input 2 is connected to GPIO */
#define TIM_TIM18_TI2_COMP1   (                                          TIM_TISEL_TI2SEL_0) /*!< TIM18 input 2 is connected to COMP1_OUT */
#define TIM_TIM18_TI2_COMP2   (                     TIM_TISEL_TI2SEL_1                     ) /*!< TIM18 input 2 is connected to COMP2_OUT */
#define TIM_TIM18_TI2_COMP3   (                     TIM_TISEL_TI2SEL_1 | TIM_TISEL_TI2SEL_0) /*!< TIM18 input 2 is connected to COMP3_OUT */
#define TIM_TIM18_TI2_COMP4   (TIM_TISEL_TI2SEL_2                                          ) /*!< TIM18 input 2 is connected to COMP4_OUT */

#define TIM_TIM10_TI1_GPIO     0x00000000U                                                    /*!< TIM10 input 1 is connected to GPIO */
#define TIM_TIM10_TI1_RTC      (                                          TIM_CCMR3_TI1SEL_0) /*!< TIM10 input 1 is connected to RTC CLOCK */
#define TIM_TIM10_TI1_HSE_32   (                     TIM_CCMR3_TI1SEL_1                     ) /*!< TIM10 input 1 is connected to HSE/32 */
#define TIM_TIM10_TI1_MCO      (                     TIM_CCMR3_TI1SEL_1 | TIM_CCMR3_TI1SEL_0) /*!< TIM10 input 1 is connected to MCO */

#define TIM_TIM11_TI1_GPIO     0x00000000U                                                    /*!< TIM11 input 1 is connected to GPIO */
#define TIM_TIM11_TI1_RTC      (                                          TIM_CCMR3_TI1SEL_0) /*!< TIM11 input 1 is connected to RTC CLOCK */
#define TIM_TIM11_TI1_HSE_32   (                     TIM_CCMR3_TI1SEL_1                     ) /*!< TIM11 input 1 is connected to HSE/32 */
#define TIM_TIM11_TI1_MCO      (                     TIM_CCMR3_TI1SEL_1 | TIM_CCMR3_TI1SEL_0) /*!< TIM11 input 1 is connected to MCO */

