Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_tim_ex.h
#define IS_TIM_INTERNAL_TRIGGEREVENT_INSTANCE(INSTANCE, __SELECTION__) \
  ((((INSTANCE) == TIM1) &&                       \
    (((__SELECTION__) == TIM_TS_ITR1) ||          \
     ((__SELECTION__) == TIM_TS_ITR2) ||          \
     ((__SELECTION__) == TIM_TS_ITR3) ||          \
     ((__SELECTION__) == TIM_TS_ITR4) ||          \
     ((__SELECTION__) == TIM_TS_ITR5) ||          \
     ((__SELECTION__) == TIM_TS_ITR6) ||          \
     ((__SELECTION__) == TIM_TS_ITR7) ||          \
     ((__SELECTION__) == TIM_TS_ITR8) ||          \
     ((__SELECTION__) == TIM_TS_ITR9) ||          \
     ((__SELECTION__) == TIM_TS_ITR10) ||          \
     ((__SELECTION__) == TIM_TS_ITR11) ||          \
     ((__SELECTION__) == TIM_TS_ITR12) ||          \
     ((__SELECTION__) == TIM_TS_ITR13) ||          \
     ((__SELECTION__) == TIM_TS_ITR14) ||          \
     ((__SELECTION__) == TIM_TS_ITR15) ||          \
     ((__SELECTION__) == TIM_TS_ITR16) ||          \
     ((__SELECTION__) == TIM_TS_ITR17) ||          \
     ((__SELECTION__) == TIM_TS_ITR18) ||          \
     ((__SELECTION__) == TIM_TS_NONE)))           \
   ||                                             \
   (((INSTANCE) == TIM2) &&                       \
    (((__SELECTION__) == TIM_TS_ITR0) ||          \
     ((__SELECTION__) == TIM_TS_ITR1) ||          \
     ((__SELECTION__) == TIM_TS_ITR2) ||          \
     ((__SELECTION__) == TIM_TS_ITR3) ||          \
     ((__SELECTION__) == TIM_TS_ITR4) ||          \
     ((__SELECTION__) == TIM_TS_ITR5) ||          \
     ((__SELECTION__) == TIM_TS_ITR6) ||          \
     ((__SELECTION__) == TIM_TS_ITR7) ||          \
     ((__SELECTION__) == TIM_TS_ITR8)||           \
     ((__SELECTION__) == TIM_TS_ITR9) ||          \
     ((__SELECTION__) == TIM_TS_ITR10) ||          \
     ((__SELECTION__) == TIM_TS_ITR11) ||          \
     ((__SELECTION__) == TIM_TS_ITR12) ||          \
     ((__SELECTION__) == TIM_TS_ITR13) ||          \
     ((__SELECTION__) == TIM_TS_ITR14) ||          \
     ((__SELECTION__) == TIM_TS_ITR15) ||          \
     ((__SELECTION__) == TIM_TS_ITR16)||          \
     ((__SELECTION__) == TIM_TS_ITR17) ||          \
     ((__SELECTION__) == TIM_TS_ITR18)||          \
     ((__SELECTION__) == TIM_TS_NONE)))           \
   ||                                        \
   (((INSTANCE) == TIM3) &&                  \
    (((__SELECTION__) == TIM_TS_ITR0) ||          \
     ((__SELECTION__) == TIM_TS_ITR1) ||          \
     ((__SELECTION__) == TIM_TS_ITR3) ||          \
     ((__SELECTION__) == TIM_TS_ITR4) ||          \
     ((__SELECTION__) == TIM_TS_ITR5) ||          \
     ((__SELECTION__) == TIM_TS_ITR6) ||          \
     ((__SELECTION__) == TIM_TS_ITR7) ||          \
     ((__SELECTION__) == TIM_TS_ITR8)||          \
     ((__SELECTION__) == TIM_TS_ITR9) ||          \
     ((__SELECTION__) == TIM_TS_ITR10) ||          \
     ((__SELECTION__) == TIM_TS_ITR11) ||          \
     ((__SELECTION__) == TIM_TS_ITR12) ||          \
     ((__SELECTION__) == TIM_TS_ITR13) ||          \
     ((__SELECTION__) == TIM_TS_ITR14) ||          \
     ((__SELECTION__) == TIM_TS_ITR15) ||          \
     ((__SELECTION__) == TIM_TS_ITR16)||          \
     ((__SELECTION__) == TIM_TS_ITR17) ||          \
     ((__SELECTION__) == TIM_TS_ITR18)||          \
     ((__SELECTION__) == TIM_TS_NONE)))           \
   ||                                        \
   (((INSTANCE) == TIM4) &&                  \
    (((__SELECTION__) == TIM_TS_ITR0) ||          \
     ((__SELECTION__) == TIM_TS_ITR1) ||          \
     ((__SELECTION__) == TIM_TS_ITR2) ||          \
     ((__SELECTION__) == TIM_TS_ITR4) ||          \
     ((__SELECTION__) == TIM_TS_ITR5) ||          \
     ((__SELECTION__) == TIM_TS_ITR6) ||          \
     ((__SELECTION__) == TIM_TS_ITR7) ||          \
     ((__SELECTION__) == TIM_TS_ITR8)||          \
     ((__SELECTION__) == TIM_TS_ITR9) ||          \
     ((__SELECTION__) == TIM_TS_ITR10) ||          \
     ((__SELECTION__) == TIM_TS_ITR11) ||          \
     ((__SELECTION__) == TIM_TS_ITR12) ||          \
     ((__SELECTION__) == TIM_TS_ITR13) ||          \
     ((__SELECTION__) == TIM_TS_ITR14) ||          \
     ((__SELECTION__) == TIM_TS_ITR15) ||          \
     ((__SELECTION__) == TIM_TS_ITR16)||          \
     ((__SELECTION__) == TIM_TS_ITR17) ||          \
     ((__SELECTION__) == TIM_TS_ITR18)||          \
     ((__SELECTION__) == TIM_TS_NONE)))           \
   ||                                        \
   (((INSTANCE) == TIM5) &&                  \
    (((__SELECTION__) == TIM_TS_ITR0) ||          \
     ((__SELECTION__) == TIM_TS_ITR1) ||          \
     ((__SELECTION__) == TIM_TS_ITR2) ||          \
     ((__SELECTION__) == TIM_TS_ITR3) ||          \
     ((__SELECTION__) == TIM_TS_ITR5) ||          \
     ((__SELECTION__) == TIM_TS_ITR6) ||          \
     ((__SELECTION__) == TIM_TS_ITR7) ||          \
     ((__SELECTION__) == TIM_TS_ITR8)||          \
     ((__SELECTION__) == TIM_TS_ITR9) ||          \
     ((__SELECTION__) == TIM_TS_ITR10) ||          \
     ((__SELECTION__) == TIM_TS_ITR11) ||          \
     ((__SELECTION__) == TIM_TS_ITR12) ||          \
     ((__SELECTION__) == TIM_TS_ITR13) ||          \
     ((__SELECTION__) == TIM_TS_ITR14) ||          \
     ((__SELECTION__) == TIM_TS_ITR15) ||          \
     ((__SELECTION__) == TIM_TS_ITR16)||          \
     ((__SELECTION__) == TIM_TS_ITR17) ||          \
     ((__SELECTION__) == TIM_TS_ITR18)||          \
     ((__SELECTION__) == TIM_TS_NONE)))           \
   ||                                        \
   (((INSTANCE) == TIM8) &&                  \
    (((__SELECTION__) == TIM_TS_ITR0) ||          \
     ((__SELECTION__) == TIM_TS_ITR1) ||          \
     ((__SELECTION__) == TIM_TS_ITR2) ||          \
     ((__SELECTION__) == TIM_TS_ITR3) ||          \
     ((__SELECTION__) == TIM_TS_ITR4) ||          \
     ((__SELECTION__) == TIM_TS_ITR6) ||          \
     ((__SELECTION__) == TIM_TS_ITR7) ||          \
     ((__SELECTION__) == TIM_TS_ITR8)||          \
     ((__SELECTION__) == TIM_TS_ITR9) ||          \
     ((__SELECTION__) == TIM_TS_ITR10) ||          \
     ((__SELECTION__) == TIM_TS_ITR11) ||          \
     ((__SELECTION__) == TIM_TS_ITR12) ||          \
     ((__SELECTION__) == TIM_TS_ITR13) ||          \
     ((__SELECTION__) == TIM_TS_ITR14) ||          \
     ((__SELECTION__) == TIM_TS_ITR15) ||          \
     ((__SELECTION__) == TIM_TS_ITR16)||          \
     ((__SELECTION__) == TIM_TS_ITR17) ||          \
     ((__SELECTION__) == TIM_TS_ITR18)||          \
     ((__SELECTION__) == TIM_TS_NONE)))           \
   ||                                        \
   (((INSTANCE) == TIM9) &&                  \
    (((__SELECTION__) == TIM_TS_ITR0) ||          \
     ((__SELECTION__) == TIM_TS_ITR1) ||          \
     ((__SELECTION__) == TIM_TS_ITR2) ||          \
     ((__SELECTION__) == TIM_TS_ITR3) ||          \
     ((__SELECTION__) == TIM_TS_ITR4) ||          \
     ((__SELECTION__) == TIM_TS_ITR5) ||          \
     ((__SELECTION__) == TIM_TS_ITR8)||          \
     ((__SELECTION__) == TIM_TS_ITR9) ||          \
     ((__SELECTION__) == TIM_TS_ITR10) ||          \
     ((__SELECTION__) == TIM_TS_ITR11) ||          \
     ((__SELECTION__) == TIM_TS_ITR12) ||          \
     ((__SELECTION__) == TIM_TS_ITR13) ||          \
     ((__SELECTION__) == TIM_TS_ITR14) ||          \
     ((__SELECTION__) == TIM_TS_ITR15) ||          \
     ((__SELECTION__) == TIM_TS_ITR16)||          \
     ((__SELECTION__) == TIM_TS_ITR17) ||          \
     ((__SELECTION__) == TIM_TS_ITR18)||          \
     ((__SELECTION__) == TIM_TS_NONE)))           \
   ||                                        \
   (((INSTANCE) == TIM12) &&                  \
    (((__SELECTION__) == TIM_TS_ITR0) ||          \
     ((__SELECTION__) == TIM_TS_ITR1) ||          \
     ((__SELECTION__) == TIM_TS_ITR2) ||          \
     ((__SELECTION__) == TIM_TS_ITR3) ||          \
     ((__SELECTION__) == TIM_TS_ITR4) ||          \
     ((__SELECTION__) == TIM_TS_ITR5) ||          \
     ((__SELECTION__) == TIM_TS_ITR6) ||          \
     ((__SELECTION__) == TIM_TS_ITR7) ||          \
     ((__SELECTION__) == TIM_TS_ITR8)||          \
     ((__SELECTION__) == TIM_TS_ITR9) ||          \
     ((__SELECTION__) == TIM_TS_ITR12) ||          \
     ((__SELECTION__) == TIM_TS_ITR13) ||          \
     ((__SELECTION__) == TIM_TS_ITR14) ||          \
     ((__SELECTION__) == TIM_TS_ITR15) ||          \
     ((__SELECTION__) == TIM_TS_ITR16)||          \
     ((__SELECTION__) == TIM_TS_ITR17) ||          \
     ((__SELECTION__) == TIM_TS_ITR18)||          \
     ((__SELECTION__) == TIM_TS_NONE)))           \
   ||                                        \
   (((INSTANCE) == TIM15) &&                  \
    (((__SELECTION__) == TIM_TS_ITR0) ||          \
     ((__SELECTION__) == TIM_TS_ITR1) ||          \
     ((__SELECTION__) == TIM_TS_ITR2) ||          \
     ((__SELECTION__) == TIM_TS_ITR3) ||          \
     ((__SELECTION__) == TIM_TS_ITR4) ||          \
     ((__SELECTION__) == TIM_TS_ITR5) ||          \
     ((__SELECTION__) == TIM_TS_ITR6) ||          \
     ((__SELECTION__) == TIM_TS_ITR7) ||          \
     ((__SELECTION__) == TIM_TS_ITR8)||          \
     ((__SELECTION__) == TIM_TS_ITR9) ||          \
     ((__SELECTION__) == TIM_TS_ITR10) ||          \
     ((__SELECTION__) == TIM_TS_ITR11) ||          \
     ((__SELECTION__) == TIM_TS_ITR12) ||          \
     ((__SELECTION__) == TIM_TS_ITR13) ||          \
     ((__SELECTION__) == TIM_TS_ITR15) ||          \
     ((__SELECTION__) == TIM_TS_ITR16)||          \
     ((__SELECTION__) == TIM_TS_ITR17) ||          \
     ((__SELECTION__) == TIM_TS_ITR18)||          \
     ((__SELECTION__) == TIM_TS_NONE)))           \
   ||                                        \
   (((INSTANCE) == TIM18) &&                 \
    (((__SELECTION__) == TIM_TS_ITR0) ||          \
     ((__SELECTION__) == TIM_TS_ITR1) ||          \
     ((__SELECTION__) == TIM_TS_ITR2) ||          \
     ((__SELECTION__) == TIM_TS_ITR3) ||          \
     ((__SELECTION__) == TIM_TS_ITR4) ||          \
     ((__SELECTION__) == TIM_TS_ITR5) ||          \
     ((__SELECTION__) == TIM_TS_ITR6) ||          \
     ((__SELECTION__) == TIM_TS_ITR7) ||          \
     ((__SELECTION__) == TIM_TS_ITR8)||          \
     ((__SELECTION__) == TIM_TS_ITR9) ||          \
     ((__SELECTION__) == TIM_TS_ITR10) ||          \
     ((__SELECTION__) == TIM_TS_ITR11) ||          \
     ((__SELECTION__) == TIM_TS_ITR12) ||          \
     ((__SELECTION__) == TIM_TS_ITR13) ||          \
     ((__SELECTION__) == TIM_TS_ITR14) ||          \
     ((__SELECTION__) == TIM_TS_ITR15) ||          \
     ((__SELECTION__) == TIM_TS_ITR16)||          \
     ((__SELECTION__) == TIM_TS_ITR18)||          \
     ((__SELECTION__) == TIM_TS_NONE))))


#define IS_TIM_OC_CHANNEL_MODE(__MODE__, __CHANNEL__)   \
  (IS_TIM_OC_MODE(__MODE__) \
   && ((((__MODE__) == TIM_OCMODE_DIRECTION_OUTPUT) || ((__MODE__) == TIM_OCMODE_PULSE_ON_COMPARE)) \
       ? (((__CHANNEL__) == TIM_CHANNEL_3) || ((__CHANNEL__) == TIM_CHANNEL_4)) : (1 == 1)))

#define IS_TIM_PULSEONCOMPARE_CHANNEL(__CHANNEL__)  \
  (((__CHANNEL__) == TIM_CHANNEL_3) ||    \
   ((__CHANNEL__) == TIM_CHANNEL_4))

#define IS_TIM_PULSEONCOMPARE_INSTANCE(INSTANCE)  IS_TIM_CC3_INSTANCE(INSTANCE)

#define IS_TIM_PULSEONCOMPARE_WIDTH(__WIDTH__)    ((__WIDTH__) <= 0xFFU)

#define IS_TIM_PULSEONCOMPARE_WIDTHPRESCALER(__PRESCALER__)    ((__PRESCALER__) <= 0x7U)

#define IS_TIM_SLAVE_PRELOAD_SOURCE(__SOURCE__)    (((__SOURCE__) == TIM_SMS_PRELOAD_SOURCE_UPDATE) \
                                                    || ((__SOURCE__) == TIM_SMS_PRELOAD_SOURCE_INDEX))

#define IS_TIM_ENCODERINDEX_POLARITY(__POLARITY__)        (((__POLARITY__) == TIM_ENCODERINDEX_POLARITY_INVERTED)  || \
                                                           ((__POLARITY__) == TIM_ENCODERINDEX_POLARITY_NONINVERTED))

#define IS_TIM_ENCODERINDEX_PRESCALER(__PRESCALER__)      (((__PRESCALER__) == TIM_ENCODERINDEX_PRESCALER_DIV1) || \
                                                           ((__PRESCALER__) == TIM_ENCODERINDEX_PRESCALER_DIV2) || \
                                                           ((__PRESCALER__) == TIM_ENCODERINDEX_PRESCALER_DIV4) || \
                                                           ((__PRESCALER__) == TIM_ENCODERINDEX_PRESCALER_DIV8))

